app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL
---
  def index
    begin
      clients = Client.all

INSERT INTO "clients" ("user_id", "uid", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "1"], ["uid", "e480c25a-706a-4863-97b4-9ac484b6dd59"], ["title", "test"], ["created_at", "2018-03-20 23:47:03.856004"], ["updated_at", "2018-03-20 23:47:03.856004"]]
---
  def create
    begin
      client = Client.new({
        :user_id => client_params[:user_id],
        :title => client_params[:title],
        :uid => SecureRandom.urlsafe_base64
      })

      if client.save

UPDATE "clients" SET "title" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["title", "test2"], ["updated_at", "2018-03-21 00:46:50.107137"], ["id", 1]]
---
  def update
    begin
      if @client.present?
        @client.attributes = client_params
        if @client.save

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 1]]
UPDATE "clients" SET "deleted_at" = '2018-03-21 01:09:09.437651' WHERE "clients"."deleted_at" IS NULL AND "clients"."id" = $1  [["id", 6]]
---
  def destroy
    begin
      if @client.present?
        @client.delete

SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."uid" = $1 ORDER BY "clients"."id" ASC LIMIT $2  [["uid", "a00c5e73-c40b-4e06-ad3e-609123beb418"], ["LIMIT", 1]]
---
  def set_client
    @client = Client.where(:uid => params[:client_id]).first