app/controllers/files_controller.rb

  def index
    begin
      files = TinyLog::File.all
---
SELECT "files".* FROM "files" WHERE "files"."deleted_at" IS NULL

  def create
    begin
      file = TinyLog::File.new({
        :name => file_params[:name],
        :uid => SecureRandom.urlsafe_base64
      })

      if file.save
---
INSERT INTO "files" ("uid", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uid", "JUifSGui0vZ2lFlAMWzMVQ"], ["name", "test"], ["created_at", "2018-09-22 23:58:37.630466"], ["updated_at", "2018-09-22 23:58:37.630466"]]

  def update
    begin
      if @file.present?
        @file.attributes = file_params
        if @file.save
---
UPDATE "files" SET "name" = $1, "updated_at" = $2 WHERE "files"."id" = $3  [["name", "Bamity"], ["updated_at", "2018-09-23 14:22:22.840189"], ["id", 29]]

  def destroy
    begin
      if @file.present?
        @file.delete
---
UPDATE "files" SET "deleted_at" = '2018-09-23 13:53:32.383616' WHERE "files"."deleted_at" IS NULL AND "files"."id" = $1  [["id", 5]]

  def set_file
    @file = TinyLog::File.where(:uid => params[:id]).first
---
SELECT  "files".* FROM "files" WHERE "files"."deleted_at" IS NULL AND "files"."uid" = $1 ORDER BY "files"."id" ASC LIMIT $2  [["uid", "yZLa5P9DdR3KNw0tUZ6tbA"], ["LIMIT", 1]]