app/controllers/folders_controller.rb

  def index
    begin
      folders = Folder.all
---
SELECT "folders".* FROM "folders" WHERE "folders"."deleted_at" IS NULL

  def create
    begin
      folder = Folder.new({
        :title => folder_params[:title],
        :uid => SecureRandom.urlsafe_base64
      })

      if folder.save!
---
INSERT INTO "folders" ("uid", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uid", "kwB-ooLZCZ2zjObhaGcG7g"], ["title", "test"], ["created_at", "2018-07-08 16:29:41.397181"], ["updated_at", "2018-07-08 16:29:41.397181"]]

  def update
    begin
      if @folder.present?
        @folder.attributes = folder_params
        if @folder.save
---
UPDATE "folders" SET "title" = $1, "updated_at" = $2 WHERE "folders"."id" = $3  [["title", "ox6V_UJDkIsXM8PqeVIp3A"], ["updated_at", "2018-07-08 21:22:45.506483"], ["id", 25]]

  def destroy
    begin
      if @folder.present?
        @folder.delete
---
UPDATE "folders" SET "deleted_at" = '2018-07-08 21:29:38.495490' WHERE "folders"."deleted_at" IS NULL AND "folders"."id" = $1  [["id", 3]]

  def set_folder
    @folder = Folder.where(:uid => params[:id]).first
---
SELECT  "folders".* FROM "folders" WHERE "folders"."deleted_at" IS NULL AND "folders"."uid" = $1 ORDER BY "folders"."id" ASC LIMIT $2  [["uid", "cr_rbvzv9UIowaEt_uYuBQ"], ["LIMIT", 1]]