app/controllers/logs_controller.rb

  def create
    begin
      log = TinyLog::Log.new({
        :text => log_params[:text],
        :log_type => log_params[:type].to_sym,
        :file => @file,
        :uid => SecureRandom.urlsafe_base64
      })

      if log.save
---
INSERT INTO "logs" ("client_id", "uid", "text", "log_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["client_id", 12], ["uid", "fG-xHX4Ox6x3TGC2tTtOPw"], ["text", "hello"], ["log_type", 3], ["created_at", "2018-03-24 03:57:57.771245"], ["updated_at", "2018-03-24 03:57:57.771245"]]

  def destroy
    begin
      if @log.present?
        @log.delete
---
UPDATE "logs" SET "deleted_at" = '2018-03-21 03:13:36.881143' WHERE "logs"."deleted_at" IS NULL AND "logs"."id" = $1  [["id", 10]]

  def set_file
    @file = TinyLog::File.where(:uid => params[:file_id]).first
---
SELECT  "files".* FROM "files" WHERE "files"."deleted_at" IS NULL AND "files"."uid" = $1 ORDER BY "files"."id" ASC LIMIT $2  [["uid", "y4OMmcUdLHpk-LuhX5m-LQ"], ["LIMIT", 1]]
SELECT  "logs".* FROM "logs" WHERE "logs"."deleted_at" IS NULL AND "logs"."uid" = $1 ORDER BY "logs"."id" ASC LIMIT $2  [["uid", "20658c90-d6f3-4e70-878c-eda82955bc01"], ["LIMIT", 1]]