app/controllers/logs_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."uid" = $1 ORDER BY "clients"."id" ASC LIMIT $2  [["uid", "a00c5e73-c40b-4e06-ad3e-609123beb418"], ["LIMIT", 1]]
---
  def set_client
    @client = Client.where(:uid => params[:client_id]).first